# Хочу лексус или тойоту от 2004 года с пробегом 150000 белую или серую с левым рулем и максимум 2 хозяина и
# стоимостью не больше 10000 или такую же , но с пробегом 200000 и с ценой меньше 8000

car1 = "Лексус"
car2 = "Тойоту"
year = 2004
milage1 = 150000
color1 = "белую"
color2 = "серую"
rule = "левый"
owner = 2
cost1 = 10000
milage2 = 200000
cost2 = 8000
print(f"Хочу {car1} или {car2} от {year} года с пробегом {milage1} {color1} {color2} с {rule} рулем и максимум "
      f"{owner} хозяина с стоимостью не больше {cost1} или такую же, но с пробегом {milage2} и с ценой {cost2}")
